#define  OS_VERSION    112                              /* 系统版本号                                   */

#define  OSVersion()     OS_VERSION                     /* 返回系统版本                                 */
#define  OSRunningTaskID() OSTaskID                     /* 返回当前任务ID                               */ 

#define K_SIG      1                                    /* 等待信号                                     */
#define K_TMO      2                                    /* 等待超时                                     */

#define NOT_OK     255                                  /* 参数错误                                     */
#define TMO_EVENT  8                                    /* 超时到                                       */
#define SIG_EVENT  4                                    /* 有信号                                       */

 
#ifndef IN_OS_CORE

extern uint8 data OSTaskID,OSNextTaskID;
extern uint8 OSIntNesting;

/*********************************************************************************************************
** 函数名称: OSTimeTick
** 功能描述: 系统时钟处理函数,处理各个任务的延时
** 输　入: 无
** 输　出: 无
** 全局变量: OSWaitTick
** 调用模块: OSIntSendSignal
********************************************************************************************************/
extern void  OSTimeTick (void);

/*********************************************************************************************************
** 函数名称: OSWait
** 功能描述: 系统等待函数,任务调用此函数可以等待一定时间或信号
** 输　入: typ: 等待事件类型,目前可以取以下值,或是其中任意个值的按位或
**             K_SIG: 等待信号
**             K_TMO: 等待超时
**        ticks : 等待超时时的系统嘀嗒数
** 输　出 : NOT_OK : 参数错误
**         TMO_EVENT : 超时到
**         SIG_EVENT : 有信号
** 全局变量: OSWaitTick
** 调用模块: OSClearSignal
********************************************************************************************************/
extern uint8 OSWait (uint8 typ, uint8 ticks);

/*********************************************************************************************************
** 函数名称: OSSendSignal
** 功能描述: 任务中给指定任务发送信号,既使指定任务就绪
** 输　入: TaskId : 任务ID
** 输　出: 无
** 全局变量: 无
** 调用模块: OSSched,OSIntSendSignal
********************************************************************************************************/
extern void OSSendSignal (uint8 TaskId);

/*********************************************************************************************************
** 函数名称: OSClearSignal
** 功能描述: 清除指定任务信号,既使指定任务休眠
** 输　入: TaskId : 任务ID
** 输　出: 无
** 全局变量: OSTaskRuning
** 调用模块: 无
********************************************************************************************************/
extern void OSClearSignal (uint8 TaskId);

/*********************************************************************************************************
** 函数名称: OSIntSendSignal
** 功能描述: 中断中给指定任务发送信号,既使指定任务就绪
** 输　入: TaskId : 任务ID
** 输　出: 无
** 全局变量: OSTaskRuning
** 调用模块: 无
********************************************************************************************************/
extern void OSIntSendSignal (uint8 TaskId);

/*********************************************************************************************************
** 函数名称: OSIntExit
** 功能描述: 中断退出处理函数,在此进行中断后的任务切换
** 输　入: 无
** 输　出: 无
** 全局变量: OSIntNesting,OSNextTaskID
** 调用模块: OSIntCtxSw
********************************************************************************************************/
extern void OSIntExit (void);

/*********************************************************************************************************
** 函数名称: OSSched
** 功能描述: 非中断的任务切换函数
** 输　入: 无
** 输　出: 无
** 全局变量: OSIntNesting,OSNextTaskID
** 调用模块: OS_TASK_SW
********************************************************************************************************/
extern void OSSched (void);

extern uint8 OSWaitTick[];
extern uint8 const OSMapTbl[];
extern uint8 data Os_Enter_Sum;

#endif
