#ifndef NOT_OK
#define NOT_OK      255                                 /* 参数错误                                     */
#endif

#define OS_Q_FULL   8                                   /* 队列满                                       */
#define OS_Q_NOT_OK 4                                   /* 无消息                                       */
#define OS_Q_TMO    2                                   /* 超时到                                       */
#define OS_Q_OK     1                                   /* 操作成功                                     */

#ifndef IN_OS_Q
/*********************************************************************************************************
** 函数名称: OSQCreate
** 功能描述: 初始化消息队列
** 输　入: Buf:为队列分配的存储空间地址
**         SizeOfBuf:为队列分配的存储空间大小
** 输　出: NOT_OK:参数错误
**         OS_Q_OK:成功
** 全局变量: 无
** 调用模块: 无
********************************************************************************************************/
extern uint8 OSQCreate(uint8 OS_Q_MEM_SEL *Buf, uint8 SizeOfBuf);

/*********************************************************************************************************
** 函数名称: OSQPend
** 功能描述: 等待消息队列中的消息
** 输　入: Ret:返回的消息
**         Buf:指向队列的指针
**         Tick:等待时间
** 输　出: NOT_OK:参数错误
**         OS_Q_OK:收到消息
**         OS_Q_TMO:超时到
**         OS_Q_NOT_OK:无消息
** 全局变量: 无
** 调用模块: OSRunningTaskID,OSClearSignal,OSSched,OS_ENTER_CRITICAL,OS_EXIT_CRITICAL
********************************************************************************************************/
extern uint8 OSQPend(uint8 data *Ret, uint8 OS_Q_MEM_SEL *Buf, uint8 Tick);

/*********************************************************************************************************
** 函数名称: OSQAccept
** 功能描述: 无等待从消息队列中取得消息
** 输　入: Ret:返回的消息
**         Buf:指向队列的指针
** 输　出: NOT_OK:参数错误
**         OS_Q_OK:收到消息
**         OS_Q_TMO:超时到
**         OS_Q_NOT_OK:无消息
** 全局变量: 无
** 调用模块: OSClearSignal,OSSched,OS_ENTER_CRITICAL,OS_EXIT_CRITICAL
********************************************************************************************************/
extern uint8 OSQAccept(uint8 data *Ret, uint8 OS_Q_MEM_SEL *Buf);

/*********************************************************************************************************
** 函数名称: OSQPost
** 功能描述: FIFO方式发送消息
** 输　入: Buf:指向队列的指针
**         Data:消息数据
** 输　出: OS_Q_FULL:队列满
**         OS_Q_OK:发送成功
** 全局变量: 无
** 调用模块: OSQIntPost,OSSched
********************************************************************************************************/
extern uint8 OSQPost(uint8 OS_Q_MEM_SEL *Buf, uint8 Data);

/*********************************************************************************************************
** 函数名称: OSQPostFront
** 功能描述: LIFO方式发送消息
** 输　入: Buf:指向队列的指针
**         Data:消息数据
** 输　出: OS_Q_FULL:队列满
**         OS_Q_OK:发送成功
** 全局变量: 无
** 调用模块: OSQIntPostFront,OSSched
********************************************************************************************************/
extern uint8 OSQPostFront(uint8 OS_Q_MEM_SEL *Buf, uint8 Data);

/*********************************************************************************************************
** 函数名称: OSQIntPost
** 功能描述: 中断中FIFO方式发送消息
** 输　入: Buf:指向队列的指针
**         Data:消息数据
** 输　出: OS_Q_FULL:队列满
**         OS_Q_OK:发送成功
** 全局变量: 无
** 调用模块: OSIntSendSignal,OS_ENTER_CRITICAL,OS_EXIT_CRITICAL
********************************************************************************************************/
extern uint8 OSQIntPost(uint8 OS_Q_MEM_SEL *Buf, uint8 Data);

/*********************************************************************************************************
** 函数名称: OSQIntPostFront
** 功能描述: 中断中LIFO方式发送消息
** 输　入: Buf:指向队列的指针
**         Data:消息数据
** 输　出: OS_Q_FULL:队列满
**         OS_Q_OK:发送成功
** 全局变量: 无
** 调用模块: OSIntSendSignal,OS_ENTER_CRITICAL,OS_EXIT_CRITICAL
********************************************************************************************************/
extern uint8 OSQIntPostFront(uint8 OS_Q_MEM_SEL *Buf, uint8 Data);

/*********************************************************************************************************
** 函数名称: OSQNMsgs
** 功能描述: 取得消息队列中消息数
** 输　入: Buf:指向队列的指针
** 输　出: 消息数
** 全局变量: 无
** 调用模块: OS_ENTER_CRITICAL,OS_EXIT_CRITICAL
********************************************************************************************************/
extern uint8 OSQNMsgs(uint8 OS_Q_MEM_SEL *Buf);

/*********************************************************************************************************
** 函数名称: OSQSize
** 功能描述: 取得消息队列总容量
** 输　入: Buf:指向队列的指针
** 输　出: 消息队列总容量
** 全局变量: 无
** 调用模块: OS_ENTER_CRITICAL,OS_EXIT_CRITICAL
********************************************************************************************************/
extern uint8 OSQSize(uint8 OS_Q_MEM_SEL *Buf);

/*********************************************************************************************************
** 函数名称: OSQFlush
** 功能描述: 清空队列
** 输　入: Buf:指向队列的指针
** 输　出: 无
** 全局变量: 无
** 调用模块: OS_ENTER_CRITICAL,OS_EXIT_CRITICAL
********************************************************************************************************/
extern void OSQFlush (uint8 OS_Q_MEM_SEL *Buf);

#endif
